**Reading CSV file**

In [2]:
import pandas as pd

In [24]:
data = pd.read_csv("Boston_Housing_Data.csv")
data.head(4)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4

In [25]:
df = pd.DataFrame(data)
print(df)

        CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD  TAX  \
0    0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900    1  296
1    0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671    2  242
2    0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671    2  242
3    0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622    3  222
4    0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622    3  222
..       ...   ...    ...   ...    ...    ...   ...     ...  ...  ...
501  0.06263   0.0  11.93   0.0  0.573  6.593  69.1  2.4786    1  273
502  0.04527   0.0  11.93   0.0  0.573  6.120  76.7  2.2875    1  273
503  0.06076   0.0  11.93   0.0  0.573  6.976  91.0  2.1675    1  273
504  0.10959   0.0  11.93   0.0  0.573  6.794  89.3  2.3889    1  273
505  0.04741   0.0  11.93   0.0  0.573  6.030   NaN  2.5050    1  273

     PTRATIO       B  LSTAT  MEDV
0       15.3  396.90   4.98  24.0
1       17.8  396.90   9.14  21.6
2       17.8  392.83   4.03  34.7
3       18.7  394.63   2.94  33.4
4       18.7  396.90    NaN  36.2
..       ...     ...    ...   ...
501     21.0  391.99    NaN  22.4
502     21.0  396.90   9.08  20.6
503     21.0  396.90   5.64  23.9
504     21.0  393.45   6.48  22.0
505     21.0  396.90   7.88  11.9

[506 rows x 14 columns]

In [26]:
#print(df.to_string())

In [27]:
print(pd.options.display.max_rows)

60

**Read Json files**

In [28]:
df1 = pd.read_json("data.json")
df1

,order_id,customer,city,date,items,payment_method,total_amount
0,O1001,Rahul Mehta,Mumbai,2025-07-10,"[{'product': 'Laptop', 'price': 55000, 'quanti...",Credit Card,56000
1,O1002,Priya Sharma,Delhi,2025-07-11,"[{'product': 'Smartphone', 'price': 20000, 'qu...",UPI,20000
2,O1003,Siddhartha H,Bengaluru,2025-07-12,"[{'product': 'Headphones', 'price': 3000, 'qua...",Debit Card,7500
3,O1004,Neha Verma,Chennai,2025-07-13,"[{'product': 'Air Conditioner', 'price': 35000...",Net Banking,35000

In [23]:
print(df1.to_string())

  order_id      customer       city       date                                                                                                             items payment_method  total_amount
0    O1001   Rahul Mehta     Mumbai 2025-07-10         [{'product': 'Laptop', 'price': 55000, 'quantity': 1}, {'product': 'Mouse', 'price': 500, 'quantity': 2}]    Credit Card         56000
1    O1002  Priya Sharma      Delhi 2025-07-11                                                        [{'product': 'Smartphone', 'price': 20000, 'quantity': 1}]            UPI         20000
2    O1003  Siddhartha H  Bengaluru 2025-07-12  [{'product': 'Headphones', 'price': 3000, 'quantity': 2}, {'product': 'Keyboard', 'price': 1500, 'quantity': 1}]     Debit Card          7500
3    O1004    Neha Verma    Chennai 2025-07-13                                                   [{'product': 'Air Conditioner', 'price': 35000, 'quantity': 1}]    Net Banking         35000

In [29]:
#head
print(df.head(3))

      CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD  TAX  PTRATIO  \
0  0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900    1  296     15.3
1  0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671    2  242     17.8
2  0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671    2  242     17.8

        B  LSTAT  MEDV
0  396.90   4.98  24.0
1  396.90   9.14  21.6
2  392.83   4.03  34.7

In [ ]:
#tail
print(d